#include <iostream>

int main(){
  // Сайт по продаже недвижимости. Переменная содержит стоимость квартиры.
    float priceApart = 0;
  
  // Программа для учета товара в обувном магазине. Переменная содержит размер пары обуви.
    int sizeShoe = 32;
  
  /* Информационная система для посетителей зоопарка. 
  *  Переменная содержит количество животных, которые находятся в 
  *  зоопарке в данный момент.  */
    int numberAnimal = 0;

  // Интернет магазин электроники. Переменная для цены нового товара.
    float priceNewProduct = 0;

    std::cout << "Размер стандартный - " << sizeShoe;
  return 0;
}